Revit 2027 API
ParameterTypeId.ImportInstanceCuttingInView Property
 "Enable Cutting in Views"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ImportInstanceCuttingInView { get; }
Public Shared ReadOnly Property ImportInstanceCuttingInView As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ImportInstanceCuttingInView {
	ForgeTypeId^ get ();
}
static member ImportInstanceCuttingInView : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace